Repository: Jeff2Ma/WhistleYoo
Catalog: Sources/whistleYooCore/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en

# about.a_native_macos_controller_for_whistle
source: Whistle 的原生 macOS 控制端
en: A native macOS controller for Whistle

# about.check_for_and_install_whistleyoo_updates_with_sparkle
source: 通过 Sparkle 检查并安装 WhistleYoo 更新。
en: Check for and install WhistleYoo updates with Sparkle.

# about.check_for_updates
source: 检查更新
en: Check for Updates

# about.check_whether_a_new_version_is_available
source: 检查是否有可用的新版本。
en: Check whether a new version is available.

# about.contact_the_author
source: 联系作者
en: Contact the Author

# about.current_version
source: 当前版本
en: Current Version

# about.official_project
source: 官方项目
en: Official Project

# about.project_information
source: 项目信息
en: Project Information

# about.report_an_issue_or_suggestion_in_github_issues
source: 在 GitHub Issues 中反馈问题或建议
en: Report an issue or suggestion in GitHub Issues

# about.software_update
source: 软件更新
en: Software Update

# about.stay_up_to_date
source: 保持最新版本
en: Stay Up to Date

# about.view_the_source_code_or_contact_the_author_on_github
source: 查看项目源码，或通过 GitHub 联系作者。
en: View the source code or contact the author on GitHub.

# console.failed_to_load_the_whistle_console
source: Whistle 面板加载失败
en: Failed to load the Whistle console

# console.loading_the_whistle_console
source: 正在加载 Whistle 面板…
en: Loading the Whistle console…

# console.open_in_browser
source: 在浏览器中打开
en: Open in Browser

# console.reload
source: 重新加载
en: Reload

# console.whistle_console
source: Whistle 面板
en: Whistle Console

# core.a_global_whistle_installation_was_not_found_run_npm_install_g_whistle
source: 未找到全局 Whistle，请执行 npm install -g whistle
en: A global Whistle installation was not found. Run npm install -g whistle.

# core.a_matching_fingerprint_was_found_in_the_login_keychain
source: 登录钥匙串中已找到匹配指纹
en: A matching fingerprint was found in the login keychain

# core.after_setting_the_proxy_scan_to_download_the_certificate_on_ios_install
source: 设置代理后扫码下载证书。iOS 还需要在系统设置中安装并开启完全信任。
en: After setting the proxy, scan to download the certificate. On iOS, install it in Settings and enable full trust.

# core.an_incompatible_whistleyoo_configuration_file_cannot_be_written
source: 不能写入版本不兼容的 WhistleYoo 配置文件
en: An incompatible WhistleYoo configuration file cannot be written

# core.apply_the_enabled_state_when_saving
source: 保存时应用启用状态
en: Apply the enabled state when saving

# core.built_in_compatibility_rules_read_only
source: 内置兼容性规则 · 只读
en: Built-in compatibility rules · Read-only

# core.built_in_rule_read_only
source: 内置规则，不可修改
en: Built-in rule, read-only

# core.changing_active_ports_safely_restarts_the_proxy_engine_automatically
source: 修改运行中的端口会自动安全重启代理引擎。
en: Changing active ports safely restarts the proxy engine automatically.

# core.command_timed_out_value
source: 命令执行超时：%@
en: Command timed out: %@

# core.disabling_the_system_proxy_did_not_complete
source: 系统代理关闭未完成
en: Disabling the system proxy did not complete

# core.do_not_decrypt_and_hide_common_domains_for_apple_icloud_jetbrains_and_ot
source: 不解密并隐藏 Apple、iCloud、JetBrains 等常用软件域名，减少证书兼容问题和抓包噪音。
en: Do not decrypt and hide common domains for Apple, iCloud, JetBrains, and other apps to reduce certificate issues and capture noise.

# core.enabling_the_system_proxy_failed_and_automatic_restoration_did_not_compl
source: 系统代理启用失败，且自动恢复未完成：%@；%@
en: Enabling the system proxy failed, and automatic restoration did not complete: %@; %@

# core.https_inspection_requires_installing_and_trusting_the_root_certificate
source: HTTPS 调试需要安装并信任根证书
en: HTTPS inspection requires installing and trusting the root certificate

# core.in_the_http_proxy_settings_for_the_phone_s_current_wi_fi_network_choose
source: 在手机当前 Wi-Fi 的 HTTP 代理设置中选择“手动”，然后填写：
en: In the HTTP proxy settings for the phone's current Wi-Fi network, choose Manual and enter:

# core.in_the_mobile_device_s_wi_fi_http_proxy_settings_choose_manual_enter_the
source: 在手机 Wi-Fi 的 HTTP 代理中选择“手动”，服务器填写上方 IP，端口填写 %@。iOS 下载证书后还需在系统设置中确认安装与信任。
en: In the mobile device's Wi-Fi HTTP proxy settings, choose Manual, enter the IP address above as the server, and use port %@. On iOS, confirm installation and trust in Settings after downloading the certificate.

# core.local_network_address
source: 局域网地址
en: Local Network Address

# core.missing_settings_migration_v_value_v_value
source: 缺少设置迁移：v%lld → v%lld
en: Missing settings migration: v%lld → v%lld

# core.network_service_value_is_still_using_the_whistleyoo_proxy
source: 网络服务“%@”仍在使用 WhistleYoo 代理
en: Network service “%@” is still using the WhistleYoo proxy

# core.network_service_value_still_has_whistleyoo_proxy_settings_that_were_not
source: 网络服务“%@”仍有 WhistleYoo 代理配置未恢复
en: Network service “%@” still has WhistleYoo proxy settings that were not restored

# core.networksetup_failed
source: networksetup 执行失败
en: networksetup failed

# core.node_js_is_too_old_version_18_or_later_is_required
source: Node.js 版本过低，需要 18 或更高版本
en: Node.js is too old. Version 18 or later is required.

# core.node_js_was_not_found_install_node_18_or_later
source: 未找到 Node.js，请安装 Node 18 或更高版本
en: Node.js was not found. Install Node 18 or later.

# core.one_whistle_rule_per_line
source: 每行一条 Whistle 规则
en: One Whistle rule per line

# core.openssl_did_not_generate_a_whistle_root_certificate
source: OpenSSL 未生成 Whistle 根证书
en: OpenSSL did not generate a Whistle root certificate

# core.port_value_is_already_in_use
source: 端口 %@ 已被占用
en: Port %@ is already in use

# core.scan_to_download_and_install_the_root_certificate
source: 扫码下载并安装根证书
en: Scan to download and install the root certificate

# core.set_up_wi_fi_proxy
source: 设置 Wi-Fi 代理
en: Set Up Wi-Fi Proxy

# core.settings
source: 设置…
en: Settings…

# core.system_proxy_restoration_did_not_complete
source: 系统代理恢复未完成
en: System proxy restoration did not complete

# core.the_configuration_file_contains_invalid_or_conflicting_ports
source: 配置文件包含无效或冲突的端口
en: The configuration file contains invalid or conflicting ports

# core.the_configuration_file_contains_invalid_or_duplicate_rule_names
source: 配置文件包含无效或重复的规则名称
en: The configuration file contains invalid or duplicate rule names

# core.the_configuration_file_must_contain_an_enabled_default_rule
source: 配置文件必须包含已启用的 Default 规则
en: The configuration file must contain an enabled Default rule

# core.the_new_rule_is_enabled_automatically_edit_its_content_on_the_right_then
source: 创建后会自动启用；可以在右侧编辑内容并保存。
en: The new rule is enabled automatically. Edit its content on the right, then save.

# core.the_operation_was_cancelled
source: 用户取消了操作
en: The operation was cancelled

# core.the_proxy_switch_for_network_service_value_could_not_be_turned_off
source: 网络服务“%@”的代理开关未能关闭
en: The proxy switch for network service “%@” could not be turned off

# core.the_root_certificate_format_is_invalid
source: 根证书格式无效
en: The root certificate format is invalid

# core.the_root_certificate_was_installed_in_the_current_user_s_keychain_sha_25
source: 根证书已安装到当前用户钥匙串。 SHA-256：%@
en: The root certificate was installed in the current user's keychain. SHA-256: %@

# core.the_running_whistle_version_is_unsupported_value
source: 运行中的 Whistle 版本不受支持：%@
en: The running Whistle version is unsupported: %@

# core.the_settings_file_is_missing_schemaversion
source: 设置文件缺少 schemaVersion
en: The settings file is missing schemaVersion

# core.the_settings_file_was_created_by_a_newer_version_of_whistleyoo
source: 设置文件来自更高版本的 WhistleYoo
en: The settings file was created by a newer version of WhistleYoo

# core.the_settings_version_in_the_configuration_file_is_incompatible_v_value
source: 配置文件中的设置版本不兼容：v%lld
en: The settings version in the configuration file is incompatible: v%lld

# core.the_system_proxy_or_proxy_engine_could_not_be_shut_down_safely_so_the_ap
source: 系统代理或代理引擎未能安全关闭，应用将继续运行。请重试；若仍失败，请检查网络代理设置。 %@
en: The system proxy or proxy engine could not be shut down safely, so the app will keep running. Try again. If the problem continues, check Network proxy settings. %@

# core.the_v1_settings_file_format_is_invalid
source: v1 设置文件格式无效
en: The v1 settings file format is invalid

# core.the_v2_settings_file_format_is_invalid
source: v2 设置文件格式无效
en: The v2 settings file format is invalid

# core.the_v3_settings_file_format_is_invalid
source: v3 设置文件格式无效
en: The v3 settings file format is invalid

# core.the_whistle_command_failed_value
source: Whistle 命令执行失败（%lld）
en: The Whistle command failed (%lld)

# core.this_removes_value_from_whistleyoo_s_dedicated_whistle_rule_storage
source: 此操作会从 Whistle 的专属规则存储中删除“%@”。
en: This removes “%@” from WhistleYoo's dedicated Whistle rule storage.

# core.unable_to_confirm_that_the_system_proxy_is_active_for_network_service_va
source: 未能确认网络服务“%@”的系统代理已生效
en: Unable to confirm that the system proxy is active for network service “%@”

# core.unable_to_confirm_that_the_system_proxy_was_enabled
source: 未能确认系统代理已生效
en: Unable to confirm that the system proxy was enabled

# core.unable_to_obtain_the_whistle_root_certificate
source: 未能获取 Whistle 根证书
en: Unable to obtain the Whistle root certificate

# core.unable_to_read_settings_value
source: 无法读取设置：%@
en: Unable to read settings: %@

# core.unable_to_read_the_node_js_version_value
source: 无法读取 Node.js 版本：%@
en: Unable to read the Node.js version: %@

# core.unable_to_read_the_whistle_version_value
source: 无法读取 Whistle 版本：%@
en: Unable to read the Whistle version: %@

# core.unable_to_read_the_whistleyoo_configuration_file_value
source: 无法读取 WhistleYoo 配置文件：%@
en: Unable to read the WhistleYoo configuration file: %@

# core.unable_to_run_value_value
source: 无法执行 %@：%@
en: Unable to run %@: %@

# core.unsupported_whistleyoo_configuration_file_version_v_value
source: 不支持的 WhistleYoo 配置文件版本：v%lld
en: Unsupported WhistleYoo configuration file version: v%lld

# core.whistle_did_not_pass_its_health_check_after_starting
source: Whistle 启动后未能通过健康检查
en: Whistle did not pass its health check after starting

# core.whistle_did_not_stop_before_the_timeout
source: Whistle 未能在超时时间内停止
en: Whistle did not stop before the timeout

# core.whistle_failed_to_save_the_allowlist_rules
source: Whistle 保存白名单规则失败
en: Whistle failed to save the allowlist rules

# core.whistle_is_too_old_version_2_9_0_or_later_is_required_detected_value
source: Whistle 版本过低，需要 2.9.0 或更高版本（检测结果：%@）
en: Whistle is too old. Version 2.9.0 or later is required (detected: %@).

# core.whistle_repeatedly_exited_unexpectedly_automatic_restart_has_stopped
source: Whistle 连续异常退出，已停止自动重启
en: Whistle repeatedly exited unexpectedly; automatic restart has stopped

# core.wi_fi_http_proxy
source: Wi-Fi HTTP 代理
en: Wi-Fi HTTP Proxy

# menu.check_for_updates
source: 检查更新…
en: Check for Updates…

# menu.cut
source: 剪切
en: Cut

# menu.discard_and_quit
source: 放弃并退出
en: Discard and Quit

# menu.ok
source: 好
en: OK

# menu.paste
source: 粘贴
en: Paste

# menu.quit_whistleyoo
source: 退出 WhistleYoo
en: Quit WhistleYoo

# menu.quitting_whistleyoo_will_discard_the_unsaved_changes_in_the_current_rule
source: 退出 WhistleYoo 将放弃当前规则中未保存的修改。
en: Quitting WhistleYoo will discard the unsaved changes in the current rule.

# menu.redo
source: 重做
en: Redo

# menu.rule_operation_in_progress
source: 规则操作仍在进行
en: Rule Operation in Progress

# menu.select_all
source: 全选
en: Select All

# menu.unable_to_quit_whistleyoo_safely
source: 无法安全退出 WhistleYoo
en: Unable to Quit WhistleYoo Safely

# menu.undo
source: 撤销
en: Undo

# menu.unsaved_rule_changes
source: 存在未保存的规则修改
en: Unsaved Rule Changes

# menu.wait_for_the_current_rule_operation_to_finish_before_quitting_whistleyoo
source: 请等待当前规则操作完成后再退出 WhistleYoo。
en: Wait for the current rule operation to finish before quitting WhistleYoo.

# mobile.connect_the_phone_to_the_same_wi_fi
source: 手机连接相同 Wi-Fi
en: Connect the phone to the same Wi-Fi

# mobile.copied
source: 已复制
en: Copied

# mobile.copy
source: 复制
en: Copy

# mobile.copy_certificate_url
source: 复制证书地址
en: Copy Certificate URL

# mobile.copy_proxy_info
source: 复制代理信息
en: Copy Proxy Info

# mobile.current_network
source: 当前网络
en: Current Network

# mobile.enter_the_proxy_server_and_port_shown_above
source: 服务器和端口填写上方代理信息
en: Enter the proxy server and port shown above

# mobile.failed_to_start
source: 启动失败
en: Failed to Start

# mobile.failed_to_start_the_proxy_engine
source: 代理引擎启动失败
en: Failed to start the proxy engine

# mobile.https_root_certificate
source: HTTPS 根证书
en: HTTPS Root Certificate

# mobile.install_and_trust_the_certificate
source: 安装并信任证书
en: Install and trust the certificate

# mobile.install_https_root_certificate
source: 安装 HTTPS 根证书
en: Install HTTPS Root Certificate

# mobile.local_network
source: 局域网
en: Local Network

# mobile.make_sure_the_phone_and_mac_are_on_the_same_local_network
source: 确保手机与 Mac 位于同一个局域网
en: Make sure the phone and Mac are on the same local network

# mobile.mobile_proxy
source: 手机代理
en: Mobile Proxy

# mobile.mobile_proxy_setup
source: 手机代理配置
en: Mobile Proxy Setup

# mobile.mobile_setup_steps
source: 手机配置步骤
en: Mobile Setup Steps

# mobile.network_interface
source: 网络接口
en: Network Interface

# mobile.no_local_ipv4_address_available_to_mobile_devices_was_detected
source: 没有检测到可供手机连接的局域网 IPv4 地址
en: No local IPv4 address available to mobile devices was detected

# mobile.port
source: 端口
en: Port

# mobile.preparing_mobile_proxy_setup
source: 正在准备手机代理配置…
en: Preparing mobile proxy setup…

# mobile.proxy_engine
source: 代理引擎
en: Proxy Engine

# mobile.proxy_engine_required
source: 需要启动代理引擎
en: Proxy Engine Required

# mobile.proxy_information
source: 代理信息
en: Proxy Information

# mobile.proxy_server
source: 代理服务器
en: Proxy Server

# mobile.proxy_service_is_listening
source: 代理服务已监听
en: Proxy service is listening

# mobile.recommended
source: 推荐
en: Recommended

# mobile.recommended_suffix
source: · 推荐
en: · Recommended

# mobile.retry
source: 重试
en: Retry

# mobile.scan_the_qr_code_on_the_right_then_enable_trust_in_system_settings
source: 扫描右侧二维码，安装后在系统设置中开启信任
en: Scan the QR code on the right, then enable trust in System Settings

# mobile.server
source: 服务器
en: Server

# mobile.set_http_proxy_to_manual
source: HTTP 代理选择“手动”
en: Set HTTP Proxy to Manual

# mobile.start_engine_and_prepare_setup
source: 启动引擎并准备配置
en: Start Engine and Prepare Setup

# mobile.start_proxy_engine
source: 启动代理引擎
en: Start Proxy Engine

# mobile.start_the_engine_to_prepare_the_mobile_proxy_address_and_https_root_cert
source: 启动后才能准备手机代理地址和 HTTPS 根证书。
en: Start the engine to prepare the mobile proxy address and HTTPS root certificate.

# mobile.the_mobile_device_and_mac_must_be_on_the_same_local_network
source: 手机与 Mac 需要连接同一个局域网
en: The mobile device and Mac must be on the same local network

# mobile.the_qr_code_uses_whistle_s_official_certificate_url_on_the_same_port_as
source: 二维码使用 Whistle 官方证书地址，并与代理共用同一端口。
en: The QR code uses Whistle's official certificate URL on the same port as the proxy.

# mobile.the_selected_interface_is_virtual_and_may_not_be_reachable_from_your_pho
source: 当前选择的是虚拟网卡，手机可能无法访问。建议选择 Wi-Fi 或当前默认网络。
en: The selected interface is virtual and may not be reachable from your phone. Choose Wi-Fi or the current default network.

# mobile.virtual
source: · 虚拟网卡
en: · Virtual

# onboarding.a_matching_fingerprint_was_found_in_the_login_keychain
source: 已通过证书指纹在登录钥匙串中确认
en: A matching fingerprint was found in the login keychain

# onboarding.back
source: 上一步
en: Back

# onboarding.certificate_does_not_match_the_current_whistle_instance
source: 证书与当前 Whistle 实例不匹配
en: Certificate does not match the current Whistle instance

# onboarding.certificate_installed
source: 证书已安装
en: Certificate installed

# onboarding.certificate_matches_the_current_whistle_instance
source: 证书与当前 Whistle 实例匹配
en: Certificate matches the current Whistle instance

# onboarding.certificate_not_installed
source: 证书未安装
en: Certificate not installed

# onboarding.check_node_js_and_whistle
source: 检查 Node.js 与 Whistle
en: Check Node.js and Whistle

# onboarding.check_proxy_ports
source: 检查代理端口
en: Check Proxy Ports

# onboarding.check_the_environment_ports_and_https_certificate
source: 完成环境、端口和 HTTPS 证书检查
en: Check the environment, ports, and HTTPS certificate

source: 配置代理监听端口和系统代理适用的网络服务。
en: Configure proxy listening ports and the network services that use the system proxy.

# onboarding.download_node_js
source: 下载 Node.js
en: Download Node.js

# onboarding.enter_two_different_valid_ports_1_65535
source: 请输入两个不同的有效端口（1–65535）
en: Enter two different valid ports (1–65535)

# onboarding.enter_valid_numeric_ports
source: 请输入有效的数字端口
en: Enter valid numeric ports

# onboarding.export_certificate
source: 导出证书…
en: Export Certificate…

# onboarding.failed_to_apply_port_settings
source: 端口设置应用失败
en: Failed to apply port settings

# onboarding.https_root_certificate_needs_attention
source: HTTPS 根证书需要检查
en: HTTPS root certificate needs attention

# onboarding.install_certificate
source: 安装证书
en: Install Certificate

# onboarding.install_certificate_action
source: 安装证书…
en: Install Certificate…

# onboarding.install_or_update_certificate
source: 安装/更新证书…
en: Install or Update Certificate…

source: 安装后才能正常调试 HTTPS 请求，证书保存在当前用户钥匙串。
en: Install the certificate to inspect HTTPS requests. It is stored in the current user's keychain.

# onboarding.install_update_certificate
source: 安装/更新证书
en: Install/Update Certificate

# onboarding.local_endpoint_127_0_0_1_value
source: 本机端口 127.0.0.1:%@
en: Local endpoint 127.0.0.1:%@

# onboarding.port_is_unavailable
source: 端口不可用
en: Port is unavailable

# onboarding.port_settings_saved
source: 端口设置已保存
en: Port settings saved

# onboarding.ports_applied_and_proxy_engine_restarted
source: 端口已应用，代理引擎已重启
en: Ports applied and proxy engine restarted

# onboarding.ports_are_available_and_the_proxy_engine_has_started
source: 端口可用，代理引擎已启动
en: Ports are available and the proxy engine has started

# onboarding.ports_in_use_value
source: 端口被占用：%@
en: Ports in use: %@

# onboarding.proxy_and_ports
source: 代理与端口
en: Proxy and Ports

# onboarding.proxy_port
source: 代理端口
en: Proxy Port

# onboarding.reinstall_certificate
source: 重新安装证书
en: Reinstall Certificate

# onboarding.root_certificate_installed
source: 根证书已安装
en: Root certificate installed

# onboarding.root_certificate_not_installed
source: 根证书尚未安装
en: Root certificate not installed

# onboarding.root_certificate_not_trusted
source: 根证书未受信任
en: Root certificate not trusted

# onboarding.root_certificate_trusted
source: 根证书已设为信任
en: Root certificate trusted

# onboarding.run_setup_assistant
source: 运行设置引导
en: Run Setup Assistant

# onboarding.run_setup_assistant_again
source: 重新执行初始化引导
en: Run Setup Assistant Again

# onboarding.setup_complete
source: 设置完成
en: Setup Complete

# onboarding.skip_certificate_installation_for_now
source: 暂时跳过证书安装
en: Skip certificate installation for now

source: Apple、iCloud、JetBrains 等服务不进行 HTTPS 解密，并从请求列表中隐藏，以减少证书错误和抓包噪音。
en: Skip HTTPS decryption for Apple, iCloud, JetBrains, and other services, and hide them from the request list to reduce certificate errors and capture noise.

# onboarding.start_the_proxy_engine_to_verify_the_instance_certificate
source: 启动代理引擎后核对实例证书
en: Start the proxy engine to verify the instance certificate

source: 证书由当前专属 Whistle 实例生成。
en: The certificate is generated by the current dedicated Whistle instance.

source: 手机代理页面也会提供局域网证书下载二维码。
en: The Mobile Proxy page also provides a QR code for downloading the certificate over the local network.

source: 代理端口供 Mac 和手机连接，并开放 Whistle 管理 UI；应用内 Web UI 端口仍仅本机访问。
en: The proxy port accepts Mac and mobile connections and exposes the Whistle management UI; the in-app Web UI port remains local-only.

# onboarding.trust_certificate_again
source: 重新信任证书…
en: Trust Certificate Again…

# onboarding.update_certificate
source: 更新证书…
en: Update Certificate…

source: 建议使用 nvm、fnm、Volta 或 Homebrew 管理 Node.js，安装 Whistle 后点击“重新检测”。
en: We recommend managing Node.js with nvm, fnm, Volta, or Homebrew. After installing Whistle, click Check Again.

# onboarding.web_ui_port
source: Web UI 端口
en: Web UI Port

# onboarding.whistleyoo_setup_assistant
source: WhistleYoo 初始化引导
en: WhistleYoo Setup Assistant

source: WhistleYoo 使用本机安装的 Node.js 和全局 Whistle。
en: WhistleYoo uses the locally installed Node.js and global Whistle package.

# plugins.failed_to_load_whistle_plugins
source: Whistle 插件加载失败
en: Failed to load Whistle plugins

# plugins.loading_whistle_plugins
source: 正在加载 Whistle 插件…
en: Loading Whistle plugins…

# plugins.start_the_proxy_engine_to_use_whistle_plugins
source: 启动代理引擎以使用 Whistle 插件。
en: Start the proxy engine to use Whistle plugins.

# plugins.whistle_plugins
source: Whistle插件
en: Whistle Plugins

# rules.apply
source: 应用
en: Apply

# rules.built_in_compatibility_rules_are_disabled_manage_them_in_settings
source: 内置兼容性规则未启用，如需管理请前往「设置」
en: Built-in compatibility rules are disabled. Manage them in Settings.

# rules.built_in_compatibility_rules_are_enabled_value_domains_manage_them_in_se
source: 内置兼容性规则已启用（%lld 个域名），如需管理请前往「设置」
en: Built-in compatibility rules are enabled (%lld domains). Manage them in Settings.

# rules.cancel
source: 取消
en: Cancel

# rules.clear_search
source: 清除搜索
en: Clear Search

# rules.combine_and_apply_rule_sets_from_whistle_in_list_order
source: 按列表顺序组合并应用 Whistle 中的规则集
en: Combine and apply rule sets from Whistle in list order

# rules.configuration
source: 规则配置
en: Rules

# rules.confirm_delete_rule
source: 删除规则？
en: Delete Rule?

# rules.continue
source: 继续
en: Continue

# rules.create
source: 创建
en: Create

# rules.create_rule
source: 新建规则
en: Create Rule

# rules.default
source: 默认
en: Default

# rules.default_always_enabled
source: 默认 · 始终启用
en: Default · Always Enabled

# rules.delete
source: 删除
en: Delete

# rules.delete_rule
source: 删除规则
en: Delete Rule

# rules.discard_changes
source: 放弃修改
en: Discard Changes

# rules.done
source: 完成
en: Done

# rules.drag_to_change_the_effective_order
source: 拖拽可调整生效顺序
en: Drag to change the effective order

# rules.edit
source: 编辑
en: Edit

# rules.enable_rule_set_value
source: 启用规则集“%@”
en: Enable rule set “%@”

# rules.enabled
source: 启用
en: Enabled

# rules.enabled_state
source: 已启用
en: Enabled

# rules.enter_one_rule_per_line_the_full_whistle_rule_syntax_is_supported
source: 每行一条规则，支持 Whistle 完整规则语法。
en: Enter one rule per line. The full Whistle rule syntax is supported.

# rules.keep_editing
source: 继续编辑
en: Keep Editing

# rules.no_editable_rules
source: 没有可编辑的规则
en: No Editable Rules

# rules.no_matching_rules
source: 没有匹配的规则
en: No Matching Rules

# rules.not_enabled
source: 未启用
en: Not Enabled

# rules.refresh
source: 刷新
en: Refresh

# rules.refresh_the_rules_or_create_a_new_rule_file
source: 刷新规则，或新建一个规则文件。
en: Refresh the rules or create a new rule file.

# rules.reload
source: 重新载入
en: Reload

# rules.reload_and_discard_changes
source: 重新载入并放弃修改？
en: Reload and Discard Changes?

# rules.reload_rules_from_whistle
source: 重新从 Whistle 载入规则
en: Reload rules from Whistle

# rules.rename
source: 重命名
en: Rename

# rules.rename_rule
source: 重命名规则
en: Rename Rule

# rules.rule_name
source: 规则名称
en: Rule Name

# rules.rule_names_must_be_unique
source: 规则名称不能重复
en: Rule names must be unique

# rules.rule_sets
source: 规则集
en: Rule Sets

# rules.rules
source: 规则
en: Rules

# rules.save
source: 保存
en: Save

# rules.saved
source: 已保存
en: Saved

# rules.search_names_or_content
source: 搜索名称或内容
en: Search names or content

# rules.settings
source: 设置
en: Settings

# rules.the_default_rule_cannot_be_deleted
source: 默认规则不能删除
en: The Default rule cannot be deleted

# rules.the_default_rule_cannot_be_modified
source: 默认规则不能修改
en: The Default rule cannot be modified

# rules.the_default_rule_cannot_be_renamed_or_overwritten
source: 默认规则不能重命名或覆盖
en: The Default rule cannot be renamed or overwritten

# rules.the_default_rule_is_always_enabled
source: 默认规则始终启用
en: The default rule is always enabled
